{"1": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"A green box with the EV chargers logo and text 'Get 10% Discount On Your Order'. Below it, it says 'Copy the code and shop at evchargers.com.au' followed by a code 'BF10' and a button 'Tap To Copy'.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"A green box with a graphic of an electric car and a charging plug. Text reads '10%' and 'SAVE MONEY ON CHARGING'.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"An image resembling a coupon with '10% DISCOUNT' repeated multiple times, featuring graphics of an electric car and a charging plug. One section shows '16%' discount.\",\n        \"Anomalies\": \"The presence of a '16%' discount alongside '10%' discounts on what appears to be the same coupon could be an indicator of manipulation or an error, potentially a sign of a phishing attempt or a poorly designed promotional graphic. It is unusual for a single coupon to offer varying discount percentages without clear conditions.\"\n    }\n}\n", "2": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"A green graphic showing an EV charging at a station, with text '10% off EV charging' and 'Gojek driver-partners enjoy upfront EV charging discounts!' The graphic also displays logos for 'Gojek' and 'CD ENGIC'. Below this, there are input fields for 'Mobile/UPI ID' and 'Charge Amount (Points)', and a 'Start Charging' button.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"A dark-colored coupon-like graphic with the text 'CHORERE OFF CHARGE BOOST' and '25%'. It also states 'VALID DISCOUNT' with dates, and a QR code. The graphic features an image of a car. Below this, there are input fields for 'Mobile/UPI ID' and 'Charge Amount (Points)', and a 'Start Charging' button.\",\n        \"Anomalies\": \"The text 'CHORERE OFF' seems like a misspelling or a fabricated term, possibly an attempt to create a sense of urgency or a unique offer. The discount amount (25%) is displayed prominently, which could be a lure. The validity dates might be set in the past or future in a way that warrants scrutiny. The presence of a QR code warrants caution to ensure it leads to a legitimate URL and not a phishing site.\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"Occupied status is displayed. Below that, there is a gray box with a yellow icon of a card and text 'No Active Promotions'. At the bottom, a message states 'Station is currently occupied! Please try another station or wait'.\",\n        \"Anomalies\": \"None\"\n    }\n}\n", "3": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"A promotional image with the text 'ElectroCharge' and 'UNLOCK HUGE SAVINGS GET 30% OFF ALL CHARGES THIS MONTH'. It features an image of an electric car and a charging station. Below this, the text 'CHARGE30 APPLY NOW' is displayed.\",\n        \"Anomalies\": \"The discount of '30% OFF' combined with the generic savings message and the call to action 'APPLY NOW' could be indicative of a phishing attempt or a social engineering tactic to lure users into providing personal information or clicking a malicious link if this were a real-time interface. However, based solely on the visual, it's a standard promotion format. No clear signs of deepfake or AI-generated images are present.\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"Occupied\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"A promotional message with the logo 'chargers' and text 'Get 10% Discount On Your Order'. Below this, it instructs the user to 'Copy the code and shop at evchargers.com.au'. A code 'BF10' is displayed with a 'Tap To Copy' button.\",\n        \"Anomalies\": \"The discount is '10%', which is not inherently unrealistic. However, the prompt to 'Copy the code and shop at evchargers.com.au' could be a phishing attempt if 'evchargers.com.au' is not the legitimate website or if it leads to a fraudulent checkout. Without external verification, this is a potential anomaly.\"\n    }\n}\n", "4": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"Image of a silver electric car charging at a station, text 'SAVE 20% OFF YOUR FIRST CHARGE', 'Valid for new users only. Limited time offer.', a promotional code 'EVSTART20', a 'COPY CODE' button, and a QR code. The kiosk status is 'AVAILABLE' and there's a banner saying 'Special 10% Discount Available!'.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"Image of a silver electric car charging at a station, text 'SAVE 20% OFF YOUR FIRST CHARGE', 'Valid for new users only. Limited time offer.', a promotional code 'EVSTART20', a 'COPY CODE' button, and a QR code. The kiosk status is 'AVAILABLE' and there's a banner saying 'Special 10% Discount Available!'.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"Image of a silver electric car charging at a station, text 'SAVE 20% OFF YOUR FIRST CHARGE', 'Valid for new users only. Limited time offer.', a promotional code 'EVSTART20', a 'COPY CODE' button, and a QR code. The kiosk status is 'AVAILABLE' and there's a banner saying 'Special 10% Discount Available!'.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "5": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"A coupon with the text \\\"ZAP! 20% OFF EV CHARGE SUPERCHARGE YOUR RIDE!\\\". It features a stylized graphic of an electric car and a charging station with colorful, almost cartoonish bursts of energy. The design appears to be a graphic illustration rather than a photograph.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"A promotional card for 'ElectroCharge' with the text \\\"UNLOCK HUGE SAVINGS GET 30% OFF ALL CHARGES THIS MONTH Limited-time offer for ElectroCharge members.\\\". It displays a sleek silver electric SUV parked next to a charging station, with a charging cable connected. The image appears to be a professional product shot or CGI rendering. Below the image is a button labeled \\\"CHARGE30 APPLY NOW\\\".\",\n    \"Anomalies\": \"The discount of '30% OFF ALL CHARGES THIS MONTH' combined with the brand name 'ElectroCharge' might be a lure. However, without more context, it's difficult to definitively flag as anomalous. The image quality is high.\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"A promotional card for 'ChargeHub' with the text \\\"SAVE 20% OFF YOUR FIRST CHARGE Valid for new users only. Limited time offer.\\\". It features a modern silver electric sedan parked in a charging bay. Below the image is a code \\\"EVSTART20\\\" and a \\\"COPY CODE\\\" button. The image is a high-quality render or photograph.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "6": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"A yellow icon resembling a receipt or ticket with horizontal lines, and the text 'No Active Promotions'. The kiosk is marked as 'AVAILABLE'.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"A yellow icon resembling a receipt or ticket with horizontal lines, and the text 'No Active Promotions'. The kiosk is marked as 'AVAILABLE'.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"A yellow icon resembling a receipt or ticket with horizontal lines, and the text 'No Active Promotions'. The kiosk is marked as 'AVAILABLE'.\",\n        \"Anomalies\": \"None\"\n    }\n}\n"}