{"1": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"Text: '10% OFF DISCOUNT ON CHARGING'. An icon of an electric charging station with lightning bolts. The overall graphic is in shades of blue and white.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"Logo for 'gojek | CD ENGINE'. Text: '10% off EV charging Gojek driver-partners enjoy upfront EV charging discounts!'. A stylized green electric car being charged with a charging cable. Several green leaf-like graphics are present. The background is black.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"Logo for 'chargers'. Text: 'Get 10% Discount On Your Order Copy the code and shop at evchargers.com.au'. A dashed box containing the code 'BF10' and a button that says 'Tap To Copy'.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "2": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"An image of a discount coupon with \\\"10% DISCOUNT\\\" text repeated, featuring a silver electric car. The text \\\"ELECTRIC VEHICLE\\\" and \\\"VALID UNTIL\\\" are also visible. There is also text \\\"Special 10% Discount Available!\\\".\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"A green graphic featuring the logos of \\\"gojek\\\" and \\\"CD\\\" with text \\\"10% off EV charging\\\" and \\\"Gojek driver-partners enjoy upfront EV charging discounts!\\\". There is also text \\\"Special 10% Discount Available!\\\".\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"Occupied\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "3": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"A promotional banner displaying '10% OFF EV CHARGING SAVE ON EV CHARGING'. It features a green electric car graphic and stylized lightning bolts. Below this, there are input fields for 'Mobile/UPI ID' and 'Charge Amount (Points)', and a 'Start Charging' button.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"Occupied. A grey box with a ticket-like icon and the text 'No Active Promotions'. Below this, a message states 'Station is currently occupied. Please try another station or wait'.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"A promotional banner displaying '10% OFF EV CHARGING SAVE ON EV CHARGING'. It features a green electric car graphic and stylized lightning bolts. Below this, there are input fields for 'Mobile/UPI ID' and 'Charge Amount (Points)', and a 'Start Charging' button.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "4": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"An image of a green electric car with \\\"10% OFF EV CHARGING SAVE ON EV CHARGING\\\" text.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"A coupon graphic with \\\"10% DISCOVNT EV CODE 10% EV REWARD\\\" text and images of two electric cars. A barcode is visible.\",\n        \"Anomalies\": \"Typo in 'DISCOUNT' as 'DISCOVNT'. While not necessarily a cyberattack, it's a sign of poor quality control which could be associated with less reputable sources.\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"A promotional image with \\\"ChargeHub SAVE 20% OFF YOUR FIRST CHARGE\\\" text, an image of a silver electric car, and a code \\\"EVSTART20\\\" with a \\\"COPY CODE\\\" button. A barcode is visible. Text indicates 'Valid for new users only. Limited time offer.'\",\n        \"Anomalies\": \"None\"\n    }\n}\n", "5": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"A green image with the Gojek and CD-ENIGMA logos. Text reads '10% off EV charging' and 'Gojek driver-partners enjoy upfront EV charging discounts!'. A stylized green electric car is depicted.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"An image depicting a silver electric car charging at a station. Text reads 'SAVE 20% OFF YOUR FIRST CHARGE' and 'EVSTART20 COPY CODE'. Below the code is a URL 'chargehub.com/promos' and a QR code.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"An image depicting a silver electric car charging at a station. Text reads 'SAVE 20% OFF YOUR FIRST CHARGE' and 'EVSTART20 COPY CODE'. Below the code is a URL 'chargehub.com/promos' and a QR code.\",\n        \"Anomalies\": \"None\"\n    }\n}\n", "6": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"Occupied. Image of a yellow ticket with \\\"No Active Promotions\\\" text.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"Image of an EV DISCOUNT COUPON with \\\"10% OFF\\\" text, a graphic of an electric car, and the text \\\"EV DEEPFAKE\\\". The coupon is visually degraded and shows signs of pixelation.\",\n    \"Anomalies\": \"The text \\\"EV DEEPFAKE\\\" is a clear indicator of a potential cyberattack. The coupon itself appears to be generated or manipulated, and the discount percentage might be unrealistic or misleading.\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"Large text displaying \\\"10% OFF DISCOUNT ON CHARGING\\\" with a graphic of an electric plug within a green box.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "7": "\n{\n  \"Kiosk 1\": {\n    \"Visual Content\": \"A green promotional banner with the Gojek and CD-ENGIC logos. It displays '10% off EV charging' in large white text, followed by smaller text: 'Gojek driver-partners enjoy upfront EV charging discounts!'. An illustration of a green electric car connected to a charging station is also present.\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 2\": {\n    \"Visual Content\": \"Occupied\",\n    \"Anomalies\": \"None\"\n  },\n  \"Kiosk 3\": {\n    \"Visual Content\": \"A bright, colorful coupon-like image with the text 'ZAP! 20% OFF EV CHARGE! SUPERCHARGE YOUr RIDE!'. It features an illustration of a blue electric car and a charging station. There is also a barcode visible at the bottom of the coupon.\",\n    \"Anomalies\": \"None\"\n  }\n}\n", "8": "\n{\n    \"Kiosk 1\": {\n        \"Visual Content\": \"Occupied\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 2\": {\n        \"Visual Content\": \"A white electric car is being charged at a charging station, with text overlaying the image: 'ChargeHub SAVE 20% OFF YOUR FIRST CHARGE Valid for new users only. 1 activated time offer.' Below this, there is a code 'EVSTART20' and a button 'COPY CODE'. A barcode is also visible. The overall branding appears to be ChargeHub.\",\n        \"Anomalies\": \"None\"\n    },\n    \"Kiosk 3\": {\n        \"Visual Content\": \"A green electric car is parked at a charging station, with text overlaying the image: 'gojek CDGNG 10% off EV charging Gojek driver-partners enjoy upfront EV charging discounts!'. Green leaf graphics are present. The branding appears to be Gojek and CDGNG.\",\n        \"Anomalies\": \"None\"\n    }\n}\n"}